package my.day8.quiz;

public class ArrayQuiz {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
/*
     MyUtil.searchWord(); 을 사용하지 마세요!!!
     
     1. String[] namesArr 을 생성합니다.
     2. "이규호,김종성,윤찬영,조원영,임규하,김규호,이종성,임규성" 을 입력합니다.
     
          프로그램을 실행을 하면
      
      ---->> 메뉴 <<-----
      1. 성찾기
      2. 이름검색
      3. 종료
      
      >> 메뉴번호 입력 => 1 
      >> 검색하실 성 입력 => 김
           김종성
           김규호
      >> 계속하실래요?(Y/N) => y
         
      ---->> 메뉴 <<-----
      1. 성찾기
      2. 이름검색
      3. 종료
      
      >> 메뉴번호 입력 => 2
      >> 검색하실 글자 입력 => 규호
           이규호
           김규호   
      >> 계속하실래요?(Y/N) => y
      
      ---->> 메뉴 <<-----
      1. 성찾기
      2. 이름검색
      3. 종료
      
      >> 메뉴번호 입력 => 2
      >> 검색하실 글자 입력 => 규
            이규호
            임규하   
            김규호
            임규성
            
      >> 계속하실래요?(Y/N) => y 
      
      ---->> 메뉴 <<-----
      1. 성찾기
      2. 이름검색
      3. 종료    
      
      >> 메뉴번호 입력 => 3 
      >> 프로그램종료!! 안녕히 가세요~~           
 */







